tiborsimon/embedded-tdd-headers/pic/pic18/pic18f6720_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F6720_H_
#define _PIC18F6720_H_

#define RCSTA2                        0
#define RCD82                         1
#define RX9D2                         2
#define RCSTA2_RCD8                   3
#define RCSTA2_RX9D                   4
#define RCSTA2_OERR                   5
#define OERR2                         6
#define FERR2                         7
#define RCSTA2_FERR                   8
#define RCSTA2_ADEN                   9
#define ADDEN2                        10
#define RCSTA2_ADDEN                  11
#define RCSTA2_CREN                   12
#define CREN2                         13
#define SREN2                         14
#define RCSTA2_SREN                   15
#define RC92                          16
#define RCSTA2_nRC8                   17
#define RCSTA2_RX9                    18
#define RCSTA2_NOT_RC8                19
#define RCSTA2_RC9                    20
#define RC8_92                        21
#define RCSTA2_RC8_9                  22
#define RX92                          23
#define RCSTA2_SPEN                   24
#define SPEN2                         25
#define TXSTA2                        26
#define TXSTA2_TXD8                   27
#define TX9D2                         28
#define TXSTA2_TX9D                   29
#define TXD82                         30
#define TRMT2                         31
#define TXSTA2_TRMT                   32
#define BRGH2                         33
#define TXSTA2_BRGH                   34
#define SENDB2                        35
#define TXSTA2_SYNC                   36
#define SYNC2                         37
#define TXEN2                         38
#define TXSTA2_TXEN                   39
#define TX8_92                        40
#define TX92                          41
#define TXSTA2_TX9                    42
#define TXSTA2_nTX8                   43
#define TXSTA2_NOT_TX8                44
#define TXSTA2_TX8_9                  45
#define TXSTA2_CSRC                   46
#define CSRC2                         47
#define CCP5CON                       48
#define CCP5M0                        49
#define CCP5M                         50
#define CCP5M1                        51
#define CCP5M2                        52
#define CCP5M3                        53
#define DCCP5Y                        54
#define DC5B0                         55
#define DC5B                          56
#define DC5B1                         57
#define DCCP5X                        58
#define CCP4CON                       59
#define CCP4M                         60
#define CCP4M0                        61
#define CCP4M1                        62
#define CCP4M2                        63
#define CCP4M3                        64
#define DCCP4Y                        65
#define DC4B0                         66
#define DC4B                          67
#define DCCP4X                        68
#define DC4B1                         69
#define T4CON                         70
#define T4CKPS0                       71
#define T4CKPS                        72
#define T4CKPS1                       73
#define TMR4ON                        74
#define T4OUTPS                       75
#define T4OUTPS0                      76
#define T4OUTPS1                      77
#define T4OUTPS2                      78
#define T4OUTPS3                      79
#define PORTA                         80
#define AN0                           81
#define PORTA_RA0                     82
#define ULPWUIN                       83
#define AN1                           84
#define PORTA_RA1                     85
#define AN2                           86
#define PORTA_RA2                     87
#define VREFM                         88
#define AN3                           89
#define PORTA_RA3                     90
#define VREFP                         91
#define PORTA_RA4                     92
#define T0CKI                         93
#define AN4                           94
#define PORTA_RA5                     95
#define LVDIN                         96
#define CLKO                          97
#define PORTA_RA6                     98
#define OSC2                          99
#define PORTB                         100
#define INT0                          101
#define PORTB_RB0                     102
#define INT1                          103
#define PORTB_RB1                     104
#define INT2                          105
#define PORTB_RB2                     106
#define CCP2A                         107
#define INT3                          108
#define CCP2_PA2                      109
#define PORTB_RB3                     110
#define RB4                           111
#define KBI0                          112
#define PGM                           113
#define KBI1                          114
#define PORTB_RB5                     115
#define PGC                           116
#define KBI2                          117
#define PORTB_RB6                     118
#define PGD                           119
#define KBI3                          120
#define PORTB_RB7                     121
#define PORTC                         122
#define T13CKI                        123
#define T1OSO                         124
#define PORTC_RC0                     125
#define PORTC_CCP2                    126
#define T1OSI                         127
#define PA2                           128
#define PORTC_RC1                     129
#define CCP1                          130
#define PA1                           131
#define PORTC_RC2                     132
#define SCL                           133
#define SCK                           134
#define PORTC_RC3                     135
#define SDA                           136
#define SDI                           137
#define PORTC_RC4                     138
#define SDO                           139
#define PORTC_RC5                     140
#define TX                            141
#define CK                            142
#define PORTC_RC6                     143
#define DT                            144
#define RX                            145
#define PORTC_RC7                     146
#define PORTD                         147
#define PORTD_RD0                     148
#define PSP0                          149
#define PORTD_RD1                     150
#define PSP1                          151
#define PORTD_RD2                     152
#define PSP2                          153
#define PORTD_RD3                     154
#define PSP3                          155
#define PORTD_RD4                     156
#define PSP4                          157
#define PORTD_RD5                     158
#define PSP5                          159
#define PORTD_RD6                     160
#define PSP6                          161
#define PORTD_RD7                     162
#define SS2                           163
#define PSP7                          164
#define PORTE                         165
#define PORTE_RD                      166
#define PD2                           167
#define RDE                           168
#define PORTE_RE0                     169
#define PORTE_WR                      170
#define WRE                           171
#define PORTE_RE1                     172
#define PC2                           173
#define CCP10                         174
#define PB2                           175
#define CS                            176
#define PORTE_RE2                     177
#define CCP9E                         178
#define PORTE_RE3                     179
#define PC3E                          180
#define PB3E                          181
#define PORTE_RE4                     182
#define CCP8E                         183
#define CCP7E                         184
#define PORTE_RE5                     185
#define PC1E                          186
#define CCP6E                         187
#define PORTE_RE6                     188
#define PB1E                          189
#define PORTE_CCP2                    190
#define CCP2E                         191
#define CCP2C                         192
#define PORTE_RE7                     193
#define PA2E                          194
#define PORTF                         195
#define PORTF_RF0                     196
#define AN5                           197
#define PORTF_RF1                     198
#define C2OUTF                        199
#define AN6                           200
#define PORTF_C2OUT                   201
#define PORTF_RF2                     202
#define AN7                           203
#define C1OUTF                        204
#define PORTF_C1OUT                   205
#define PORTF_RF3                     206
#define AN8                           207
#define PORTF_RF4                     208
#define AN9                           209
#define PORTF_RF5                     210
#define PORTF_CVREF                   211
#define AN10                          212
#define PORTF_RF6                     213
#define AN11                          214
#define PORTF_RF7                     215
#define SS                            216
#define PORTG                         217
#define PORTG_RG0                     218
#define CCP3                          219
#define TX2                           220
#define PORTG_RG1                     221
#define C3OUTG                        222
#define CK2                           223
#define PORTG_RG2                     224
#define DT2                           225
#define RX2                           226
#define PORTG_RG3                     227
#define CCP4                          228
#define PORTG_RG4                     229
#define CCP5                          230
#define LATA                          231
#define LATA0                         232
#define LA0                           233
#define LATA1                         234
#define LA1                           235
#define LATA2                         236
#define LA2                           237
#define LATA3                         238
#define LA3                           239
#define LATA4                         240
#define LA4                           241
#define LATA5                         242
#define LA5                           243
#define LATA6                         244
#define LA6                           245
#define LATB                          246
#define LB0                           247
#define LATB0                         248
#define LB1                           249
#define LATB1                         250
#define LB2                           251
#define LATB2                         252
#define LB3                           253
#define LATB3                         254
#define LB4                           255
#define LATB4                         256
#define LB5                           257
#define LATB5                         258
#define LB6                           259
#define LATB6                         260
#define LB7                           261
#define LATB7                         262
#define LATC                          263
#define LATC0                         264
#define LC0                           265
#define LATC1                         266
#define LC1                           267
#define LATC2                         268
#define LC2                           269
#define LATC3                         270
#define LC3                           271
#define LATC4                         272
#define LC4                           273
#define LATC5                         274
#define LC5                           275
#define LATC6                         276
#define LC6                           277
#define LATC7                         278
#define LC7                           279
#define LATD                          280
#define LATD0                         281
#define LD0                           282
#define LATD1                         283
#define LD1                           284
#define LATD2                         285
#define LD2                           286
#define LATD3                         287
#define LD3                           288
#define LATD4                         289
#define LD4                           290
#define LATD5                         291
#define LD5                           292
#define LATD6                         293
#define LD6                           294
#define LATD7                         295
#define LD7                           296
#define LATE                          297
#define LATE0                         298
#define LE0                           299
#define LATE1                         300
#define LE1                           301
#define LATE2                         302
#define LE2                           303
#define LATE3                         304
#define LE3                           305
#define LATE4                         306
#define LE4                           307
#define LATE5                         308
#define LE5                           309
#define LATE6                         310
#define LE6                           311
#define LATE7                         312
#define LE7                           313
#define LATF                          314
#define LATF0                         315
#define LF0                           316
#define LATF1                         317
#define LF1                           318
#define LF2                           319
#define LATF2                         320
#define LF3                           321
#define LATF3                         322
#define LF4                           323
#define LATF4                         324
#define LF5                           325
#define LATF5                         326
#define LF6                           327
#define LATF6                         328
#define LF7                           329
#define LATF7                         330
#define LATG                          331
#define LATG0                         332
#define LG0                           333
#define LATG1                         334
#define LG1                           335
#define LATG2                         336
#define LG2                           337
#define LATG3                         338
#define LG3                           339
#define LATG4                         340
#define LG4                           341
#define TRISA                         342
#define TRISA_RA0                     343
#define TRISA0                        344
#define TRISA_RA1                     345
#define TRISA1                        346
#define TRISA2                        347
#define TRISA_RA2                     348
#define TRISA_RA3                     349
#define TRISA3                        350
#define TRISA_RA4                     351
#define TRISA4                        352
#define TRISA_RA5                     353
#define TRISA5                        354
#define TRISA_RA6                     355
#define TRISA6                        356
#define TRISB                         357
#define TRISB_RB0                     358
#define TRISB0                        359
#define TRISB_RB1                     360
#define TRISB1                        361
#define TRISB_RB2                     362
#define TRISB2                        363
#define TRISB_RB3                     364
#define TRISB3                        365
#define RB4                           366
#define TRISB4                        367
#define TRISB_RB5                     368
#define TRISB5                        369
#define TRISB_RB6                     370
#define TRISB6                        371
#define TRISB_RB7                     372
#define TRISB7                        373
#define TRISC                         374
#define TRISC0                        375
#define TRISC_RC0                     376
#define TRISC1                        377
#define TRISC_RC1                     378
#define TRISC2                        379
#define TRISC_RC2                     380
#define TRISC3                        381
#define TRISC_RC3                     382
#define TRISC4                        383
#define TRISC_RC4                     384
#define TRISC5                        385
#define TRISC_RC5                     386
#define TRISC6                        387
#define TRISC_RC6                     388
#define TRISC7                        389
#define TRISC_RC7                     390
#define TRISD                         391
#define TRISD_RD0                     392
#define TRISD0                        393
#define TRISD_RD1                     394
#define TRISD1                        395
#define TRISD_RD2                     396
#define TRISD2                        397
#define TRISD_RD3                     398
#define TRISD3                        399
#define TRISD_RD4                     400
#define TRISD4                        401
#define TRISD_RD5                     402
#define TRISD5                        403
#define TRISD_RD6                     404
#define TRISD6                        405
#define TRISD_RD7                     406
#define TRISD7                        407
#define TRISE                         408
#define TRISE_RE0                     409
#define TRISE0                        410
#define TRISE1                        411
#define TRISE_RE1                     412
#define TRISE2                        413
#define TRISE_RE2                     414
#define TRISE_RE3                     415
#define TRISE3                        416
#define TRISE_RE4                     417
#define TRISE4                        418
#define TRISE_RE5                     419
#define TRISE5                        420
#define TRISE_RE6                     421
#define TRISE6                        422
#define TRISE_RE7                     423
#define TRISE7                        424
#define TRISF                         425
#define TRISF0                        426
#define TRISF_RF0                     427
#define TRISF_RF1                     428
#define TRISF1                        429
#define TRISF_RF2                     430
#define TRISF2                        431
#define TRISF3                        432
#define TRISF_RF3                     433
#define TRISF_RF4                     434
#define TRISF4                        435
#define TRISF_RF5                     436
#define TRISF5                        437
#define TRISF_RF6                     438
#define TRISF6                        439
#define TRISF7                        440
#define TRISF_RF7                     441
#define TRISG                         442
#define TRISG0                        443
#define TRISG_RG0                     444
#define TRISG1                        445
#define TRISG_RG1                     446
#define TRISG2                        447
#define TRISG_RG2                     448
#define TRISG_RG3                     449
#define TRISG3                        450
#define TRISG4                        451
#define TRISG_RG4                     452
#define PIE1                          453
#define TMR1IE                        454
#define TMR2IE                        455
#define CCP1IE                        456
#define SSPIE                         457
#define TXIE                          458
#define TX1IE                         459
#define RCIE                          460
#define RC1IE                         461
#define ADIE                          462
#define PSPIE                         463
#define PIR1                          464
#define TMR1IF                        465
#define TMR2IF                        466
#define CCP1IF                        467
#define SSPIF                         468
#define TXIF                          469
#define TX1IF                         470
#define RCIF                          471
#define RC1IF                         472
#define ADIF                          473
#define PSPIF                         474
#define IPR1                          475
#define TMR1IP                        476
#define TMR2IP                        477
#define CCP1IP                        478
#define SSPIP                         479
#define TX1IP                         480
#define TXIP                          481
#define RC1IP                         482
#define RCIP                          483
#define ADIP                          484
#define PSPIP                         485
#define PIE2                          486
#define CCP2IE                        487
#define TMR3IE                        488
#define LVDIE                         489
#define BCLIE                         490
#define EEIE                          491
#define CMIE                          492
#define PIR2                          493
#define CCP2IF                        494
#define TMR3IF                        495
#define LVDIF                         496
#define BCLIF                         497
#define EEIF                          498
#define CMIF                          499
#define IPR2                          500
#define CCP2IP                        501
#define TMR3IP                        502
#define LVDIP                         503
#define BCLIP                         504
#define EEIP                          505
#define CMIP                          506
#define PIE3                          507
#define CCP3IE                        508
#define RXB0IE                        509
#define RXBNIE                        510
#define RXB1IE                        511
#define CCP4IE                        512
#define TXB0IE                        513
#define CCP5IE                        514
#define TMR4IE                        515
#define TXB1IE                        516
#define TXB2IE                        517
#define TXBNIE                        518
#define TX2IE                         519
#define RC2IE                         520
#define PIR3                          521
